UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_vga.c
/*
 * esp32_vga.c — ESP32-S3 VGA (RGB332 over LCD_CAM) option setter + display
 * bring-up.
 *
 * OPTION VGA r2,r1,r0,g2,g1,g0,b1,b0,hsync,vsync
 *   Stores the ten GPIOs that drive an external resistor-ladder DAC
 *   (VGA666-style, wired RGB332). The eight data pins are listed
 *   most-significant first per channel.
 * OPTION VGA 3BIT r,g,b,hsync,vsync
 *   8-colour mode for a 1-bit-per-channel DAC (Serial Wombat board):
 *   only the three channel MSBs are wired.
 * OPTION VGA SYNC hsync,vsync
 *   Diagnostic sync polarity override. Each argument is NEGATIVE
 *   (standard VGA, idle high / pulse low) or POSITIVE.
 * OPTION VGA DISABLE
 *   Clears the configuration.
 *
 * A pixel clock is not exposed: LCD_CAM paces its DMA from pclk_hz
 * internally and a resistor-DAC VGA has no PCLK input, so the panel is
 * created with pclk_gpio_num = -1 (no clock pin routed).
 *
 * esp32_vga_display_init() brings the panel up at boot when configured,
 * binds the RGB332 draw primitives, and points the framebuffer globals
 * at the continuously-scanned LCD_CAM buffer. The REPL is mirrored to
 * VGA and USB serial when VGA is configured.
 */

#include <ctype.h>
#include <stdint.h>
#include <string.h>

#include "esp_heap_caps.h"
#include "esp_system.h" /* esp_restart */

#include "MMBasic_Includes.h"
#include "Hardware_Includes.h"
#include "port_config.h"
#include "hal/hal_pin.h"
#include "hal/hal_vga_ops.h"

#include "drivers/draw_rgb332/draw_rgb332.h"
#include "vga_lcdcam_s3.h"
#include "esp32_option_ext.h"

/* Core framebuffer + draw-pointer globals (defined in Draw.c / state). */
extern short HRes, VRes, DisplayHRes, DisplayVRes;
extern short CurrentX, CurrentY;
extern int ScreenSize;
extern uint32_t framebuffersize;
extern unsigned char *WriteBuf, *DisplayBuf, *FrameBuf, *LayerBuf, *SecondFrame, *SecondLayer, *FRAMEBUFFER;
extern unsigned char OptionConsole;
extern volatile int DISPLAY_TYPE;
extern void (*DrawRectangle)(int x1, int y1, int x2, int y2, int c);
extern void (*DrawBitmap)(int x1, int y1, int width, int height, int scale, int fc, int bc, unsigned char * bitmap);
extern void (*ScrollLCD)(int lines);
extern void (*DrawBuffer)(int x1, int y1, int x2, int y2, unsigned char * c);
extern void (*ReadBuffer)(int x1, int y1, int x2, int y2, unsigned char * c);
extern void (*DrawBufferFast)(int x1, int y1, int x2, int y2, int blank, unsigned char * c);
extern void (*ReadBufferFast)(int x1, int y1, int x2, int y2, unsigned char * c);
extern void (*DrawPixel)(int x1, int y1, int c);
extern void ApplyDefaultConsoleColours(void);

#define ESP32_VGA_SYNC_MAGIC 0x80u
#define ESP32_VGA_SYNC_MASK (VGA_LCDCAM_SYNC_HSYNC_IDLE_LOW | VGA_LCDCAM_SYNC_VSYNC_IDLE_LOW)
#define ESP32_VGA_CLOCK_SHIFT 2u
#define ESP32_VGA_CLOCK_MASK 0x0cu
#define ESP32_VGA_DRIVE_SHIFT 4u
#define ESP32_VGA_DRIVE_MASK 0x30u
#define ESP32_VGA_DRIVE_MAGIC 0x40u
#define ESP32_VGA_DISABLED_MAGIC 0x7fu
#define ESP32_VGA_MODE_640X480 1
#define ESP32_VGA_MODE_320X240 2
#define ESP32_VGA_MODE_320X240_DITHER 3
#define ESP32_VGA_INTERNAL_MODE_640X480 5
#define ESP32_VGA_INTERNAL_MODE_320X240 6
#define ESP32_VGA_INTERNAL_MODE_320X240_DITHER 7
#define ESP32_VGA_MODE_320X240_W 320
#define ESP32_VGA_MODE_320X240_H 240

static uint8_t * s_vga_scanout_fb = NULL;
static uint8_t * s_vga_logical_fb = NULL;
static int s_vga_mode = ESP32_VGA_MODE_640X480;

static uint8_t vga_sync_flags(void) {
    return (ESP32_OPTION_VGA_PCLK & ESP32_VGA_SYNC_MAGIC) ? (ESP32_OPTION_VGA_PCLK & ESP32_VGA_SYNC_MASK) : 0;
}

static uint8_t vga_clock_mode(void) {
    return (ESP32_OPTION_VGA_PCLK & ESP32_VGA_SYNC_MAGIC)
               ? ((ESP32_OPTION_VGA_PCLK & ESP32_VGA_CLOCK_MASK) >> ESP32_VGA_CLOCK_SHIFT)
               : VGA_LCDCAM_CLOCK_STANDARD;
}

static uint8_t vga_drive_cap(void) {
    if (!(ESP32_OPTION_VGA_PCLK & ESP32_VGA_SYNC_MAGIC)) return 2;
    if (!(ESP32_OPTION_VGA_PCLK & ESP32_VGA_DRIVE_MAGIC)) return 2;
    return (ESP32_OPTION_VGA_PCLK & ESP32_VGA_DRIVE_MASK) >> ESP32_VGA_DRIVE_SHIFT;
}

static uint8_t vga_pack_option_flags(uint8_t sync_flags, uint8_t clock_mode, uint8_t drive_cap) {
    return ESP32_VGA_SYNC_MAGIC |
           (sync_flags & ESP32_VGA_SYNC_MASK) |
           ((clock_mode << ESP32_VGA_CLOCK_SHIFT) & ESP32_VGA_CLOCK_MASK) |
           ESP32_VGA_DRIVE_MAGIC |
           ((drive_cap << ESP32_VGA_DRIVE_SHIFT) & ESP32_VGA_DRIVE_MASK);
}

static uint8_t vga_3bit_default_sync_flags(void) {
    return 0;
}

static uint8_t vga_3bit_default_clock_mode(void) {
    return VGA_LCDCAM_CLOCK_25MHZ;
}

static const char * vga_clock_name(uint8_t mode) {
    switch (mode) {
    case VGA_LCDCAM_CLOCK_PLL240:
        return "PLL240";
    case VGA_LCDCAM_CLOCK_25MHZ:
        return "25MHZ";
    case VGA_LCDCAM_CLOCK_25MHZ240:
        return "25MHZ240";
    case VGA_LCDCAM_CLOCK_STANDARD:
    default:
        return "STANDARD";
    }
}

static int parse_vga_clock_mode(unsigned char * arg) {
    unsigned char * p = arg;
    skipspace(p);
    if (checkstring(p, (unsigned char *)"STANDARD")) return VGA_LCDCAM_CLOCK_STANDARD;
    if (checkstring(p, (unsigned char *)"PLL240")) return VGA_LCDCAM_CLOCK_PLL240;
    if (checkstring(p, (unsigned char *)"25MHZ240")) return VGA_LCDCAM_CLOCK_25MHZ240;
    if (checkstring(p, (unsigned char *)"25MHZ")) return VGA_LCDCAM_CLOCK_25MHZ;
    return (int)getint(p, 0, 3);
}

/* True once OPTION VGA has supplied a usable pin map. Needs at least the
 * per-channel MSBs (bus bits 7/4/1) plus sync: full RGB332 sets all eight
 * data pins, while 3-bit (8-colour) sets only these three and leaves the
 * rest unconnected (esp_lcd skips data lines configured as -1). */
static int vga_configured(void) {
    return ESP32_OPTION_VGA_DATA[7] && ESP32_OPTION_VGA_DATA[4] && ESP32_OPTION_VGA_DATA[1] &&
           Option.VGA_HSYNC && ESP32_OPTION_VGA_VSYNC;
}

static int vga_disabled_by_user(void) {
    return ESP32_OPTION_VGA_PCLK == ESP32_VGA_DISABLED_MAGIC;
}

/* Translate a stored pin number to its chip GPIO via the Metro pin map. */
static int pin_to_gpio(int pin) {
    if (pin <= 0 || pin > NBRPINS) return -1;
    return PinDef[pin].GPno;
}

static int esp32_vga_pin_invalid(int pin) {
    return pin <= 0 || pin > NBRPINS || (PinDef[pin].mode & UNUSED);
}

static int esp32_vga_pin_reserved(int pin) {
    return !esp32_vga_pin_invalid(pin) && ExtCurrentConfig[pin] == EXT_BOOT_RESERVED;
}

static int esp32_vga_is_current_pin(int pin) {
    if (!esp32_vga_pin_reserved(pin))
        return 0;
    if (pin == Option.VGA_HSYNC || pin == ESP32_OPTION_VGA_VSYNC)
        return 1;
    for (int i = 0; i < ESP32_OPTION_VGA_DATA_COUNT; i++)
        if (ESP32_OPTION_VGA_DATA[i] == pin)
            return 1;
    return 0;
}

static void esp32_vga_release_pin(int pin) {
    if (!esp32_vga_pin_reserved(pin))
        return;
    hal_pin_deinit((uint32_t)PinDef[pin].GPno);
    ExtCurrentConfig[pin] = EXT_NOT_CONFIG;
}

static void esp32_vga_require_available_pin(int pin) {
    if (esp32_vga_pin_invalid(pin))
        error("Invalid pin");
    if (ExtCurrentConfig[pin] != EXT_NOT_CONFIG && !esp32_vga_is_current_pin(pin))
        error("Pin %/| is in use", pin, pin);
}

static void esp32_vga_require_distinct_pins(const uint8_t * pins, size_t count) {
    for (size_t i = 0; i < count; i++) {
        if (!pins[i]) continue;
        for (size_t j = i + 1; j < count; j++) {
            if (pins[i] == pins[j])
                error("Pin %/| is in use", pins[j], pins[j]);
        }
    }
}

static void esp32_vga_reserve_pin(int pin) {
    if (!esp32_vga_pin_invalid(pin))
        ExtCurrentConfig[pin] = EXT_BOOT_RESERVED;
}

