UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_vga.c
void esp32_vga_reserve_option_pins(void) {
    if (!vga_configured()) return;
    for (int i = 0; i < ESP32_OPTION_VGA_DATA_COUNT; i++)
        esp32_vga_reserve_pin(ESP32_OPTION_VGA_DATA[i]);
    esp32_vga_reserve_pin(Option.VGA_HSYNC);
    esp32_vga_reserve_pin(ESP32_OPTION_VGA_VSYNC);
}

static void esp32_vga_clear_options(void) {
    for (int i = 0; i < ESP32_OPTION_VGA_DATA_COUNT; i++)
        esp32_vga_release_pin(ESP32_OPTION_VGA_DATA[i]);
    esp32_vga_release_pin(Option.VGA_HSYNC);
    esp32_vga_release_pin(ESP32_OPTION_VGA_VSYNC);
    memset(ESP32_OPTION_VGA_DATA, 0, ESP32_OPTION_VGA_DATA_COUNT);
    Option.VGA_HSYNC = 0;
    ESP32_OPTION_VGA_VSYNC = 0;
}

static void esp32_vga_present_region(int x1, int y1, int x2, int y2) {
    int t;
    if (!vga_lcdcam_s3_active() || HRes <= 0 || VRes <= 0) return;
    if (x2 < x1) {
        t = x1;
        x1 = x2;
        x2 = t;
    }
    if (y2 < y1) {
        t = y1;
        y1 = y2;
        y2 = t;
    }
    if (x1 < 0) x1 = 0;
    if (y1 < 0) y1 = 0;
    if (x2 >= HRes) x2 = HRes - 1;
    if (y2 >= VRes) y2 = VRes - 1;
    if (x1 > x2 || y1 > y2) return;

    if (s_vga_mode == ESP32_VGA_MODE_320X240 && WriteBuf == s_vga_logical_fb) {
        vga_lcdcam_s3_present_rgb332_2x(s_vga_logical_fb, ESP32_VGA_MODE_320X240_W,
                                        ESP32_VGA_MODE_320X240_H, ESP32_VGA_MODE_320X240_W,
                                        x1, y1, x2, y2);
    } else if (s_vga_mode == ESP32_VGA_MODE_320X240_DITHER && WriteBuf == s_vga_logical_fb) {
        vga_lcdcam_s3_present_rgb332_2x_dither3(s_vga_logical_fb, ESP32_VGA_MODE_320X240_W,
                                                ESP32_VGA_MODE_320X240_H, ESP32_VGA_MODE_320X240_W,
                                                x1, y1, x2, y2);
    } else if (s_vga_mode == ESP32_VGA_MODE_640X480 && WriteBuf == s_vga_scanout_fb) {
        vga_lcdcam_s3_flush_region(x1, y1, x2, y2);
    }
}

static void esp32_vga_present_all(void) {
    if (s_vga_mode == ESP32_VGA_MODE_320X240 && s_vga_logical_fb == FRAMEBUFFER) {
        vga_lcdcam_s3_present_rgb332_2x(s_vga_logical_fb, ESP32_VGA_MODE_320X240_W,
                                        ESP32_VGA_MODE_320X240_H, ESP32_VGA_MODE_320X240_W,
                                        0, 0, ESP32_VGA_MODE_320X240_W - 1,
                                        ESP32_VGA_MODE_320X240_H - 1);
    } else if (s_vga_mode == ESP32_VGA_MODE_320X240_DITHER && s_vga_logical_fb == FRAMEBUFFER) {
        vga_lcdcam_s3_present_rgb332_2x_dither3(s_vga_logical_fb, ESP32_VGA_MODE_320X240_W,
                                                ESP32_VGA_MODE_320X240_H, ESP32_VGA_MODE_320X240_W,
                                                0, 0, ESP32_VGA_MODE_320X240_W - 1,
                                                ESP32_VGA_MODE_320X240_H - 1);
    } else if (s_vga_mode == ESP32_VGA_MODE_640X480 && s_vga_scanout_fb == FRAMEBUFFER) {
        vga_lcdcam_s3_flush_all();
    }
}

static void esp32_DrawRectangle256(int x1, int y1, int x2, int y2, int c) {
    DrawRectangle256(x1, y1, x2, y2, c);
    esp32_vga_present_region(x1, y1, x2, y2);
}

static void esp32_DrawBitmap256(int x1, int y1, int width, int height, int scale, int fc, int bc, unsigned char * bitmap) {
    DrawBitmap256(x1, y1, width, height, scale, fc, bc, bitmap);
    esp32_vga_present_region(x1, y1, x1 + width * scale - 1, y1 + height * scale - 1);
}

static void esp32_DrawBuffer256(int x1, int y1, int x2, int y2, unsigned char * p) {
    DrawBuffer256(x1, y1, x2, y2, p);
    esp32_vga_present_region(x1, y1, x2, y2);
}

static void esp32_DrawBuffer256Fast(int x1, int y1, int x2, int y2, int blank, unsigned char * p) {
    DrawBuffer256Fast(x1, y1, x2, y2, blank, p);
    esp32_vga_present_region(x1, y1, x2, y2);
}

static void esp32_DrawPixel256(int x, int y, int c) {
    DrawPixel256(x, y, c);
    esp32_vga_present_region(x, y, x, y);
}

static void esp32_ScrollLCD256(int lines) {
    ScrollLCD256(lines);
    esp32_vga_present_region(0, 0, HRes - 1, VRes - 1);
}

static void esp32_vga_bind_rgb332_draw(void) {
    DrawRectangle = esp32_DrawRectangle256;
    DrawBitmap = esp32_DrawBitmap256;
    ScrollLCD = esp32_ScrollLCD256;
    DrawBuffer = esp32_DrawBuffer256;
    ReadBuffer = ReadBuffer256;
    DrawBufferFast = esp32_DrawBuffer256Fast;
    ReadBufferFast = ReadBuffer256Fast;
    DrawPixel = esp32_DrawPixel256;
}

static uint8_t * esp32_vga_alloc_logical_fb(size_t bytes) {
    uint8_t * p = heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!p) p = heap_caps_malloc(bytes, MALLOC_CAP_8BIT);
    return p;
}

static int esp32_vga_mode_from_internal(int mode) {
    if (mode == ESP32_VGA_INTERNAL_MODE_640X480) return ESP32_VGA_MODE_640X480;
    if (mode == ESP32_VGA_INTERNAL_MODE_320X240) return ESP32_VGA_MODE_320X240;
    if (mode == ESP32_VGA_INTERNAL_MODE_320X240_DITHER) return ESP32_VGA_MODE_320X240_DITHER;
    return mode;
}

static int esp32_vga_display_type_for_mode(int mode) {
    if (mode == ESP32_VGA_MODE_320X240) return SCREENMODE6;
    if (mode == ESP32_VGA_MODE_320X240_DITHER) return SCREENMODE7;
    return SCREENMODE5;
}

static int esp32_vga_apply_mode(int mode, bool clear) {
    mode = esp32_vga_mode_from_internal(mode);
    if (!vga_lcdcam_s3_active() || !s_vga_scanout_fb) return 0;
    if (mode != ESP32_VGA_MODE_640X480 &&
        mode != ESP32_VGA_MODE_320X240 &&
        mode != ESP32_VGA_MODE_320X240_DITHER) return 0;

    if (mode == ESP32_VGA_MODE_640X480) {
        if (s_vga_logical_fb) {
            heap_caps_free(s_vga_logical_fb);
            s_vga_logical_fb = NULL;
        }
        HRes = DisplayHRes = VGA_LCDCAM_HRES;
        VRes = DisplayVRes = VGA_LCDCAM_VRES;
        ScreenSize = VGA_LCDCAM_HRES * VGA_LCDCAM_VRES;
        framebuffersize = (uint32_t)ScreenSize;
        FRAMEBUFFER = WriteBuf = DisplayBuf = FrameBuf = LayerBuf = SecondFrame = SecondLayer = s_vga_scanout_fb;
    } else {
        const size_t bytes = ESP32_VGA_MODE_320X240_W * ESP32_VGA_MODE_320X240_H;
        if (!s_vga_logical_fb) {
            s_vga_logical_fb = esp32_vga_alloc_logical_fb(bytes);
            if (!s_vga_logical_fb) error("Not enough memory");
            clear = true;
        }
        HRes = DisplayHRes = ESP32_VGA_MODE_320X240_W;
        VRes = DisplayVRes = ESP32_VGA_MODE_320X240_H;
        ScreenSize = (int)bytes;
        framebuffersize = (uint32_t)ScreenSize;
        FRAMEBUFFER = WriteBuf = DisplayBuf = FrameBuf = LayerBuf = SecondFrame = SecondLayer = s_vga_logical_fb;
    }

