UKTailwind/PicoMiteAllVersions/ports/esp32_s3_metro/main/esp32_vga.c
    Option.DISPLAY_TYPE = esp32_vga_display_type_for_mode(mode);
    DISPLAY_TYPE = Option.DISPLAY_TYPE;
    Option.DISPLAY_CONSOLE = 1;
    OptionConsole = 3;
    s_vga_mode = mode;
    esp32_vga_bind_rgb332_draw();
    ApplyDefaultConsoleColours();
    if (clear) {
        memset(WriteBuf, 0, ScreenSize);
        vga_lcdcam_s3_clear(0);
        if (mode == ESP32_VGA_MODE_320X240)
            vga_lcdcam_s3_present_rgb332_2x(WriteBuf, HRes, VRes, HRes, 0, 0, HRes - 1, VRes - 1);
    } else if (mode == ESP32_VGA_MODE_320X240) {
        vga_lcdcam_s3_present_rgb332_2x(WriteBuf, HRes, VRes, HRes, 0, 0, HRes - 1, VRes - 1);
    } else if (mode == ESP32_VGA_MODE_320X240_DITHER) {
        vga_lcdcam_s3_present_rgb332_2x_dither3(WriteBuf, HRes, VRes, HRes, 0, 0, HRes - 1, VRes - 1);
    } else {
        vga_lcdcam_s3_flush_all();
    }
    CurrentX = 0;
    CurrentY = 0;
    return 1;
}

void esp32_vga_display_init(void) {
    if (!vga_configured()) return;
    if (vga_lcdcam_s3_active()) return;

    vga_lcdcam_pins_t pins;
    for (int i = 0; i < 8; i++) pins.data_gpio[i] = pin_to_gpio(ESP32_OPTION_VGA_DATA[i]);
    pins.hsync_gpio = pin_to_gpio(Option.VGA_HSYNC);
    pins.vsync_gpio = pin_to_gpio(ESP32_OPTION_VGA_VSYNC);
    pins.pclk_gpio = -1; /* no PCLK pin: LCD_CAM paces DMA from pclk_hz */
    pins.sync_flags = vga_sync_flags();
    pins.clock_mode = vga_clock_mode();
    pins.drive_cap = vga_drive_cap();
    if (pins.data_gpio[7] < 0 || pins.data_gpio[4] < 0 || pins.data_gpio[1] < 0 ||
        pins.hsync_gpio < 0 || pins.vsync_gpio < 0)
        return;

    uint8_t * fb = NULL;
    if (!vga_lcdcam_s3_init(&pins, &fb) || fb == NULL) return;

    s_vga_scanout_fb = fb;
    hal_vga_ops_set_fastgfx_present_callback(esp32_vga_present_all);
    esp32_vga_apply_mode(ESP32_VGA_MODE_640X480, true);
}

int esp32_vga_apply_default_options_if_unset(void) {
    if (vga_configured() || vga_disabled_by_user()) return 0;
    int r = codemap(8);
    int g = codemap(9);
    int b = codemap(10);
    int hsync = codemap(11);
    int vsync = codemap(12);
    if (r <= 0 || g <= 0 || b <= 0 || hsync <= 0 || vsync <= 0) return 0;
    memset(ESP32_OPTION_VGA_DATA, 0, ESP32_OPTION_VGA_DATA_COUNT);
    ESP32_OPTION_VGA_DATA[7] = r;
    ESP32_OPTION_VGA_DATA[4] = g;
    ESP32_OPTION_VGA_DATA[1] = b;
    Option.VGA_HSYNC = hsync;
    ESP32_OPTION_VGA_VSYNC = vsync;
    ESP32_OPTION_VGA_PCLK = vga_pack_option_flags(0, VGA_LCDCAM_CLOCK_25MHZ, 2);
    return 1;
}

void setmode(int mode, bool clear) {
    if (!vga_lcdcam_s3_active()) return;
    if (!esp32_vga_apply_mode(mode, clear)) error("Invalid mode");
}

void cmd_mode(void) {
    int mode = getint(cmdline, ESP32_VGA_MODE_640X480, ESP32_VGA_MODE_320X240_DITHER);
    setmode(mode, true);
}

/* Parse one GPIO token (plain chip GPIO number) into a stored pin index. */
static int parse_vga_gpio(unsigned char * arg) {
    /* Accept either a "GPn" pin name or a raw chip GPIO number, matching
     * how pins are written elsewhere (e.g. OPTION AUDIO). A bare getint()
     * would treat "GP8" as an auto-created variable (= 0), silently
     * mis-storing the pin. */
    unsigned char * p = arg;
    skipspace(p);
    int gpio;
    if ((p[0] == 'G' || p[0] == 'g') && (p[1] == 'P' || p[1] == 'p') && isdigit(p[2]))
        gpio = (int)getinteger(p + 2);
    else
        gpio = (int)getinteger(p);
    if (gpio < 0 || gpio >= HAL_PORT_GPIO_COUNT) error("Invalid pin");
    int pin = codemap(gpio);
    if (pin <= 0 || pin > NBRPINS) error("Invalid pin");
    return pin;
}

static int parse_vga_sync_polarity(unsigned char * arg) {
    unsigned char * p = arg;
    skipspace(p);
    if (checkstring(p, (unsigned char *)"NEGATIVE")) return 0;
    if (checkstring(p, (unsigned char *)"POSITIVE")) return 1;
    return (int)getint(p, 0, 1);
}

int esp32_vga_option_setter(unsigned char * line) {
    unsigned char * tp = checkstring(line, (unsigned char *)"VGA");
    if (!tp) return 0;
    if (CurrentLinePtr) error("Invalid in a program");

    if (checkstring(tp, (unsigned char *)"DISABLE")) {
        esp32_vga_clear_options();
        ESP32_OPTION_VGA_PCLK = ESP32_VGA_DISABLED_MAGIC;
        SaveOptions();
        _excep_code = RESET_COMMAND;
        esp_restart();
        return 1;
    }

    unsigned char * sp = checkstring(tp, (unsigned char *)"SYNC");
    if (sp) {
        getargs(&sp, 3, (unsigned char *)","); /* 2 args -> 3 tokens */
        if (argc != 3) error("Syntax: OPTION VGA SYNC NEGATIVE|POSITIVE,NEGATIVE|POSITIVE");
        uint8_t flags = 0;
        if (parse_vga_sync_polarity(argv[0])) flags |= VGA_LCDCAM_SYNC_HSYNC_IDLE_LOW;
        if (parse_vga_sync_polarity(argv[2])) flags |= VGA_LCDCAM_SYNC_VSYNC_IDLE_LOW;
        ESP32_OPTION_VGA_PCLK = vga_pack_option_flags(flags, vga_clock_mode(), vga_drive_cap());
        SaveOptions();
        _excep_code = RESET_COMMAND;
        esp_restart();
        return 1;
    }

    sp = checkstring(tp, (unsigned char *)"CLOCK");
    if (sp) {
        getargs(&sp, 1, (unsigned char *)",");
        if (argc != 1) error("Syntax: OPTION VGA CLOCK STANDARD|PLL240|25MHZ|25MHZ240");
        ESP32_OPTION_VGA_PCLK = vga_pack_option_flags(vga_sync_flags(), parse_vga_clock_mode(argv[0]), vga_drive_cap());
        SaveOptions();
        _excep_code = RESET_COMMAND;
        esp_restart();
        return 1;
    }

    sp = checkstring(tp, (unsigned char *)"DRIVE");
    if (sp) {
        getargs(&sp, 1, (unsigned char *)",");
        if (argc != 1) error("Syntax: OPTION VGA DRIVE 0..3");
        ESP32_OPTION_VGA_PCLK = vga_pack_option_flags(vga_sync_flags(), vga_clock_mode(), (uint8_t)getint(argv[0], 0, 3));
        SaveOptions();
        _excep_code = RESET_COMMAND;
        esp_restart();
        return 1;
    }

    /* 3-bit (8-colour) mode for a 1-bit-per-channel DAC (e.g. the Serial
     * Wombat board). Only the three channel MSBs are wired; the remaining
     * five RGB332 bus bits stay unconnected (-1, skipped by esp_lcd). */
    unsigned char * bp = checkstring(tp, (unsigned char *)"3BIT");
    if (bp) {
        uint8_t sync_flags = vga_3bit_default_sync_flags();
        uint8_t pins[5];
        uint8_t data[ESP32_OPTION_VGA_DATA_COUNT] = {0};
        getargs(&bp, 9, (unsigned char *)","); /* 5 pins -> 9 tokens */
        if (argc != 9) error("Syntax: OPTION VGA 3BIT r,g,b,hsync,vsync");
        pins[0] = data[7] = parse_vga_gpio(argv[0]); /* red   -> bus bit 7 */
        pins[1] = data[4] = parse_vga_gpio(argv[2]); /* green -> bus bit 4 */
        pins[2] = data[1] = parse_vga_gpio(argv[4]); /* blue  -> bus bit 1 */
        pins[3] = parse_vga_gpio(argv[6]);
        pins[4] = parse_vga_gpio(argv[8]);
        for (int i = 0; i < 5; i++) esp32_vga_require_available_pin(pins[i]);
        esp32_vga_require_distinct_pins(pins, 5);
        esp32_vga_clear_options();
        memcpy(ESP32_OPTION_VGA_DATA, data, ESP32_OPTION_VGA_DATA_COUNT);
        Option.VGA_HSYNC = pins[3];
        ESP32_OPTION_VGA_VSYNC = pins[4];
        ESP32_OPTION_VGA_PCLK = vga_pack_option_flags(sync_flags, vga_3bit_default_clock_mode(), vga_drive_cap());
        esp32_vga_reserve_option_pins();
        SaveOptions();
        _excep_code = RESET_COMMAND;
        esp_restart();
        return 1;
    }

    uint8_t sync_flags = vga_sync_flags();
    uint8_t pins[10];
    uint8_t data[ESP32_OPTION_VGA_DATA_COUNT] = {0};
    getargs(&tp, 19, (unsigned char *)","); /* 10 pins -> up to 19 tokens */
    if (argc != 19) error("Syntax: OPTION VGA r2,r1,r0,g2,g1,g0,b1,b0,hsync,vsync");

    /* argv order is MSB-first per channel; store so VGA_DATA[bit] holds
     * the pin driving bus bit `bit` (bit 7 = red MSB .. bit 0 = blue LSB). */
    for (int i = 0; i < 8; i++)
        pins[i] = data[7 - i] = parse_vga_gpio(argv[i * 2]);
    pins[8] = parse_vga_gpio(argv[16]);
    pins[9] = parse_vga_gpio(argv[18]);
    for (int i = 0; i < 10; i++) esp32_vga_require_available_pin(pins[i]);
    esp32_vga_require_distinct_pins(pins, 10);
    esp32_vga_clear_options();
    memcpy(ESP32_OPTION_VGA_DATA, data, ESP32_OPTION_VGA_DATA_COUNT);
    Option.VGA_HSYNC = pins[8];
    ESP32_OPTION_VGA_VSYNC = pins[9];
    ESP32_OPTION_VGA_PCLK = vga_pack_option_flags(sync_flags, vga_clock_mode(), vga_drive_cap());
    esp32_vga_reserve_option_pins();

    SaveOptions();
    _excep_code = RESET_COMMAND;
    esp_restart();
    return 1;
}

/* LIST OPTIONS line. 3-bit mode wires only the three channel MSBs (bus
 * bits 7/4/1); full RGB332 also sets the lower bits, so a non-MSB data
 * pin distinguishes the two forms. */
void esp32_vga_print_options(void) {
    if (!vga_configured()) return;
    uint8_t sync_flags = vga_sync_flags();
    int full = ESP32_OPTION_VGA_DATA[0] || ESP32_OPTION_VGA_DATA[2];
    MMPrintString("OPTION VGA ");
    if (full) {
        for (int i = 7; i >= 0; i--) {
            MMPrintString((char *)PinDef[ESP32_OPTION_VGA_DATA[i]].pinname);
            MMputchar(',', 1);
        }
    } else {
        MMPrintString("3BIT ");
        MMPrintString((char *)PinDef[ESP32_OPTION_VGA_DATA[7]].pinname);
        MMputchar(',', 1);
        MMPrintString((char *)PinDef[ESP32_OPTION_VGA_DATA[4]].pinname);
        MMputchar(',', 1);
        MMPrintString((char *)PinDef[ESP32_OPTION_VGA_DATA[1]].pinname);
        MMputchar(',', 1);
    }
    MMPrintString((char *)PinDef[Option.VGA_HSYNC].pinname);
    MMputchar(',', 1);
    MMPrintString((char *)PinDef[ESP32_OPTION_VGA_VSYNC].pinname);
    PRet();
    MMPrintString("OPTION VGA SYNC ");
    MMPrintString((sync_flags & VGA_LCDCAM_SYNC_HSYNC_IDLE_LOW) ? "POSITIVE" : "NEGATIVE");
    MMputchar(',', 1);
    MMPrintString((sync_flags & VGA_LCDCAM_SYNC_VSYNC_IDLE_LOW) ? "POSITIVE" : "NEGATIVE");
    PRet();
    MMPrintString("OPTION VGA CLOCK ");
    MMPrintString((char *)vga_clock_name(vga_clock_mode()));
    PRet();
    MMPrintString("OPTION VGA DRIVE ");
    char drive[4];
    IntToStr(drive, vga_drive_cap(), 10);
    MMPrintString(drive);
    PRet();
}
